In [5]:
# Import necessary libraries
import pandas as pd

In [42]:
#Read csv file
df = pd.read_csv('Manipulation.csv')

In [50]:
# Data Filtering
# Select rows where Age is greater than 25
filtered_df = df[df['Age'] > 25]

In [52]:
# Dropping column whos index is o
df.drop(df.columns[0], axis=1, inplace= True)

In [54]:
# Display the results
print("\nFiltered Data (Age > 25):")
filtered_df

Filtered Data (Age > 25):

    Name  Age         City  Salary
1    Bob   30  Los Angeles   60000
3  David   35      Houston   70000
4    Eve   28        Miami   55000

In [58]:
# Data Sorting
# Sort the DataFrame by Salary in descending order
sorted_df = df.sort_values(by='Salary', ascending=False)

In [60]:
# Dropping column whos index is o
df.drop(df.columns[0], axis=1, inplace= True)

In [62]:
print("\nSorted Data (by Salary):")
sorted_df

Sorted Data (by Salary):

   Age         City  Salary
3   35      Houston   70000
1   30  Los Angeles   60000
4   28        Miami   55000
0   25     New York   50000
2   22      Chicago   45000

In [64]:
# Data Grouping and Aggregation
# Group data by City and calculate the average salary in each city
grouped_df = df.groupby('City')['Salary'].mean().reset_index()

In [66]:
# Dropping column whos index is o
df.drop(df.columns[0], axis=1, inplace= True)

In [68]:
print("\nGrouped and Aggregated Data (Average Salary by City):")
grouped_df

Grouped and Aggregated Data (Average Salary by City):

          City   Salary
0      Chicago  45000.0
1      Houston  70000.0
2  Los Angeles  60000.0
3        Miami  55000.0
4     New York  50000.0